<a href="https://colab.research.google.com/github/otanet/RecSys/blob/master/1_data_munging.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from google.colab import drive 
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

In [0]:
cd /content/drive/My Drive/data/

/content/drive/My Drive/data

In [0]:
ls

movies_metadata.csv

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.read_csv('movies_metadata.csv')

df.head()

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (10) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

   adult  ... vote_count
0  False  ...     5415.0
1  False  ...     2413.0
2  False  ...       92.0
3  False  ...       34.0
4  False  ...      173.0

[5 rows x 24 columns]

In [0]:
#Output the type of df
type(df)

pandas.core.frame.DataFrame

In [0]:
#Output the shape of df
df.shape

(45466, 24)

In [0]:
#Output the columns of df
df.columns

Index(['adult', 'belongs_to_collection', 'budget', 'genres', 'homepage', 'id',
       'imdb_id', 'original_language', 'original_title', 'overview',
       'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'video',
       'vote_average', 'vote_count'],
      dtype='object')

In [0]:
#Select the second movie in df
second = df.iloc[1]
second

adult                                                                False
belongs_to_collection                                                  NaN
budget                                                            65000000
genres                   [{'id': 12, 'name': 'Adventure'}, {'id': 14, '...
homepage                                                               NaN
id                                                                    8844
imdb_id                                                          tt0113497
original_language                                                       en
original_title                                                     Jumanji
overview                 When siblings Judy and Peter discover an encha...
popularity                                                         17.0155
poster_path                               /vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg
production_companies     [{'name': 'TriStar Pictures', 'id': 559}, {'na...
production_countries     [{'iso_3166_1': 'US', 'name': 'United States o...
release_date                                                    1995-12-15
revenue                                                        2.62797e+08
runtime                                                                104
spoken_languages         [{'iso_639_1': 'en', 'name': 'English'}, {'iso...
status                                                            Released
tagline                          Roll the dice and unleash the excitement!
title                                                              Jumanji
video                                                                False
vote_average                                                           6.9
vote_count                                                            2413
Name: 1, dtype: object

In [0]:
#Change the index to the title
df = df.set_index('title')

#Access the movie with title 'Jumanji'
jum = df.loc['Jumanji']
jum

adult                                                                False
belongs_to_collection                                                  NaN
budget                                                            65000000
genres                   [{'id': 12, 'name': 'Adventure'}, {'id': 14, '...
homepage                                                               NaN
id                                                                    8844
imdb_id                                                          tt0113497
original_language                                                       en
original_title                                                     Jumanji
overview                 When siblings Judy and Peter discover an encha...
popularity                                                         17.0155
poster_path                               /vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg
production_companies     [{'name': 'TriStar Pictures', 'id': 559}, {'na...
production_countries     [{'iso_3166_1': 'US', 'name': 'United States o...
release_date                                                    1995-12-15
revenue                                                        2.62797e+08
runtime                                                                104
spoken_languages         [{'iso_639_1': 'en', 'name': 'English'}, {'iso...
status                                                            Released
tagline                          Roll the dice and unleash the excitement!
video                                                                False
vote_average                                                           6.9
vote_count                                                            2413
Name: Jumanji, dtype: object

In [0]:
df = df.reset_index()

In [0]:
#Create a smaller dataframe with a subset of all features
small_df = df[['title', 'release_date', 'budget', 'revenue', 'runtime', 'genres']]

#Output only the first 5 rows of small_df
small_df.head()

                         title  ...                                             genres
0                    Toy Story  ...  [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
1                      Jumanji  ...  [{'id': 12, 'name': 'Adventure'}, {'id': 14, '...
2             Grumpier Old Men  ...  [{'id': 10749, 'name': 'Romance'}, {'id': 35, ...
3            Waiting to Exhale  ...  [{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...
4  Father of the Bride Part II  ...                     [{'id': 35, 'name': 'Comedy'}]

[5 rows x 6 columns]

In [0]:
#Display the first 15 rows
small_df.head(15)

                          title  ...                                             genres
0                     Toy Story  ...  [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
1                       Jumanji  ...  [{'id': 12, 'name': 'Adventure'}, {'id': 14, '...
2              Grumpier Old Men  ...  [{'id': 10749, 'name': 'Romance'}, {'id': 35, ...
3             Waiting to Exhale  ...  [{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...
4   Father of the Bride Part II  ...                     [{'id': 35, 'name': 'Comedy'}]
5                          Heat  ...  [{'id': 28, 'name': 'Action'}, {'id': 80, 'nam...
6                       Sabrina  ...  [{'id': 35, 'name': 'Comedy'}, {'id': 10749, '...
7                  Tom and Huck  ...  [{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...
8                  Sudden Death  ...  [{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...
9                     GoldenEye  ...  [{'id': 12, 'name': 'Adventure'}, {'id': 28, '...
10       The American President  ...  [{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...
11  Dracula: Dead and Loving It  ...  [{'id': 35, 'name': 'Comedy'}, {'id': 27, 'nam...
12                        Balto  ...  [{'id': 10751, 'name': 'Family'}, {'id': 16, '...
13                        Nixon  ...  [{'id': 36, 'name': 'History'}, {'id': 18, 'na...
14             Cutthroat Island  ...  [{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...

[15 rows x 6 columns]

In [0]:
#Get information of the data types of each feature
small_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         45460 non-null  object
 1   release_date  45379 non-null  object
 2   budget        45466 non-null  object
 3   revenue       45460 non-null  float64
 4   runtime       45203 non-null  float64
 5   genres        45466 non-null  object
dtypes: float64(2), object(4)
memory usage: 2.1+ MB

In [0]:
df['budget'].astype('float')

ValueError: ignored

In [0]:
#Import the numpy library 
import numpy as np

#Function to convert to float manually
def to_float(x):
    try:
        x = float(x)
    except: 
        x = np.nan
    return x

#Apply the to_float function to all values in the budget column
small_df['budget'] = small_df['budget'].apply(to_float)

#Try converting to float using pandas astype
small_df['budget'] = small_df['budget'].astype('float')

#Get the data types for all features
small_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         45460 non-null  object
 1   release_date  45379 non-null  object
 2   budget        45463 non-null  float64
 3   revenue       45460 non-null  float64
 4   runtime       45203 non-null  float64
 5   genres        45466 non-null  object
dtypes: float64(3), object(3)
memory usage: 2.1+ MB

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if sys.path[0] == '':
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  from ipykernel import kernelapp as app

In [0]:
#Convert release_date into pandas datetime format
small_df['release_date'] = pd.to_datetime(small_df['release_date'], errors='coerce')

#Extract year from the datetime
small_df['year'] = small_df['release_date'].apply(lambda x: str(x).split('-')[0] if x != np.nan else np.nan)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [0]:
#Sort DataFrame based on release year
small_df = small_df.sort_values('year')

small_df.head()

                               title  ...  year
34940               Passage of Venus  ...  1874
34937     Sallie Gardner at a Gallop  ...  1878
41602                Buffalo Running  ...  1883
34933    Man Walking Around a Corner  ...  1887
34938  Traffic Crossing Leeds Bridge  ...  1888

[5 rows x 7 columns]

In [0]:
#Sort Movies based on revenue (in descending order)
small_df = small_df.sort_values('revenue', ascending=False)

small_df.head()

                              title  ...  year
14551                        Avatar  ...  2009
26555  Star Wars: The Force Awakens  ...  2015
1639                        Titanic  ...  1997
17818                  The Avengers  ...  2012
25084                Jurassic World  ...  2015

[5 rows x 7 columns]

In [0]:
#Select only those movies which earned more than 1 billion
new = small_df[small_df['revenue'] > 1e9]

new

                                               title  ...  year
14551                                         Avatar  ...  2009
26555                   Star Wars: The Force Awakens  ...  2015
1639                                         Titanic  ...  1997
17818                                   The Avengers  ...  2012
25084                                 Jurassic World  ...  2015
28830                                      Furious 7  ...  2015
26558                        Avengers: Age of Ultron  ...  2015
17437   Harry Potter and the Deathly Hallows: Part 2  ...  2011
22110                                         Frozen  ...  2013
42222                           Beauty and the Beast  ...  2017
43255                        The Fate of the Furious  ...  2017
20830                                     Iron Man 3  ...  2013
30700                                        Minions  ...  2015
26567                     Captain America: Civil War  ...  2016
17293                 Transformers: Dark of the Moon  ...  2011
7000   The Lord of the Rings: The Return of the King  ...  2003
19261                                        Skyfall  ...  2012
23617                Transformers: Age of Extinction  ...  2014
18252                          The Dark Knight Rises  ...  2012
15348                                    Toy Story 3  ...  2010
11008     Pirates of the Caribbean: Dead Man's Chest  ...  2006
41489                   Rogue One: A Star Wars Story  ...  2016
17124    Pirates of the Caribbean: On Stranger Tides  ...  2011
38176                                   Finding Dory  ...  2016
14892                            Alice in Wonderland  ...  2010
36253                                       Zootopia  ...  2016
19971              The Hobbit: An Unexpected Journey  ...  2012
44009                                Despicable Me 3  ...  2017
12481                                The Dark Knight  ...  2008

[29 rows x 7 columns]

In [0]:
#Select only those movies which earned more than 1 billion and spent less than 150 million

new2 = small_df[(small_df['revenue'] > 1e9) & (small_df['budget'] < 1.5e8)]
new2

                                               title  ...  year
17437   Harry Potter and the Deathly Hallows: Part 2  ...  2011
30700                                        Minions  ...  2015
7000   The Lord of the Rings: The Return of the King  ...  2003
44009                                Despicable Me 3  ...  2017

[4 rows x 7 columns]

In [0]:
type(small_df['year'])

pandas.core.series.Series

In [0]:

#Get the runtime Series object
runtime = small_df['runtime']

#Print the longest runtime of any movie
print(runtime.max())

#Print the shortest runtime of any movie
print(runtime.min())

1256.0
0.0

In [0]:
#Get the budget Series object
budget = small_df['budget']

#Print the mean budget of the movies
print(budget.mean())

#Print the median budget of the movies
print(budget.median())

4224578.813474693
0.0

In [0]:
#Get the revenue Series object
revenue = small_df['revenue']

#Revenue generated by the 90th percentile movie
revenue.quantile(0.90)

8267610.399999982

In [0]:
#Get number of movies released each year
small_df['year'].value_counts()

2014    1974
2015    1905
2013    1889
2012    1722
2011    1667
        ...
1887       1
2020       1
1878       1
1874       1
1893       1
Name: year, Length: 136, dtype: int64